Revit 2024 API
RailingHeightCorrectionOption Enumeration
 Railing height correction option.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum RailingHeightCorrectionOption
Visual Basic
Public Enumeration RailingHeightCorrectionOption
Visual C++
public enum class RailingHeightCorrectionOption
Members
Member name | Description
ByType |  Railing height is determined by railing type.
Custom |  User needs to define the height value of the railing.
See Also
Autodesk.Revit.DB.Architecture Namespace